Sens1602/hattori_sens/PIC/PIC18F2553_USB_Circuits.X/miniPSD_wireless.c
/********************************************************************
 * miniPSD wireless version
********************************************************************/
#include "usb_function_cdc.h"
#include "GenericTypeDefs.h"
#include "Compiler.h"
#include "usb_config.h"
#include "usb_device.h"
#include "usb.h"
#include "HardwareProfile.h"
#include "p18f2553.h"
#include "i2c.h"
#include "stdio.h"
#include "stdlib.h"
#include "timers.h"
#include "adc.h"
#include "usart.h"
#include "delays.h"
/**configration***********************/
//pragma　http://chitose6thplant.web.fc2.com/pic18f/2550/pragma_config2550.htm
//I2C　http://www.maroon.dti.ne.jp/koten-kairo/works/dsPIC/i2c3.html
//Probably, 4 MHz is generated from the oscillator 12 MHz by 3
//→It generates 96 MHz with PLL, it also divides by 2 to generate 48 MHz, it is used for USB clock and system clock
//datasheet:2550,TABLE 2-3:
#pragma config FOSC = HSPLL_HS    
#pragma config PLLDIV = 3               //12MHz
#pragma config CPUDIV = OSC1_PLL2       //2分周でCPU48MHz
#pragma config VREGEN = ON              //USB用レギュレータON
#pragma config USBDIV =2                //2分周でUSBクロック生成
#pragma config FCMEN = OFF
#pragma config IESO = OFF
#pragma config PWRT = ON
#pragma config BOR = ON
#pragma config BORV =1
#pragma config MCLRE = ON
#pragma config WDT = OFF
#pragma config WDTPS = 32
#pragma config LVP = OFF
#pragma config XINST = OFF
#pragma config DEBUG = OFF
#pragma config PBADEN = ON       //ポートBをデフォルトでデジタル
//#pragma config ICPRT = OFF              //？

/**global variable************/
#pragma udata
char USB_Out_Buf[CDC_DATA_OUT_EP_SIZE];
char USB_In_Buf[CDC_DATA_IN_EP_SIZE];
USB_HANDLE    lastTransmission;
unsigned char i;

int err;//I2C通信エラーコード受信
char outbuf[30];//
unsigned long counter;
int b;
char temp;

//RN4020 commands
char usart_buf[16]  = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
char kanon[] = "kanopero";
char pinon[] = "pippi";
char junon[] = "cool";
char junon2[2] = {'j', 'u'};
char character = 'a';
char CR = '\r';
int usart_counter = 0;

char echo = '+';
char echo2[3] = {'+', '\r', '\n'};
char cmd0[] = {'R', ',', '1', '\r', '\n'};
char cmd1[6] = {'S', 'F', ',', '1', '\r', '\n'};
char cmd2[] = {'S', 'S', ',', '0', '0', '8', '0', '0', '0', '0', '0',  '\r', '\n'};
char cmd3[] = {'S', 'R', ',', '3', '2', '0', '0', '0', '0', '0', '0',  '\r', '\n'};
char cmd4[] = {'S','H','W',',','2','A','2','B',',','4','B','4','1','4','E','4','F','5','0','4','5','5','2','4','F', '\r', '\n'};

/**function prototype *******************/
void YourHighPriorityISRCode();
void YourLowPriorityISRCode();
unsigned int WI2C( unsigned char control, 
            unsigned char address, unsigned char data);
unsigned int RI2C(unsigned char control, unsigned char address);
void Calc();
void Delay_s(int tm);
void Delay_ms(int tm);
void Delay_us(int tm);

/*** interrupt vector***/
#pragma code REMAPPED_HIGH_INTERRUPT_VECTOR = 0x08
void Remapped_High_ISR (void){
     _asm goto YourHighPriorityISRCode _endasm
}
#pragma code REMAPPED_LOW_INTERRUPT_VECTOR = 0x18
void Remapped_Low_ISR (void){
     _asm goto YourLowPriorityISRCode _endasm
}
	
#pragma code
/****interrupt function***/
#pragma interrupt YourHighPriorityISRCode
void YourHighPriorityISRCode(){
    //Timer1 interrupt
    if(INTCONbits.TMR0IF){ //割り込み要因がTimer1割り込みなら        
        INTCONbits.TMR0IF = 0; //フラグクリア 
        WriteTimer0(35416);//タイマセット
        //デバイス接続確認
        if(USB_BUS_SENSE && (USBGetDeviceState() == DETACHED_STATE))
            USBDeviceAttach();// USB割り込み許可			
        // 処理実行
        if((USBDeviceState >= CONFIGURED_STATE)&&(USBSuspendControl!=1)){
            //Calc();//データ取得、送信
 
            while(!USBUSARTIsTxTrfReady()) CDCTxService();//これで取りこぼしせず送れるが何故かはまだ不明      
            putrsUSBUSART("R,1\r\n");
            CDCTxService();
            putsUSART(cmd0);


        }
     //USART Rx 
    }else if(PIR1bits.RCIF){
        if(RCSTAbits.OERR || RCSTAbits.FERR){
            RCSTA = 0;
            RCSTA = 0x90;
        }   
        /*
        while(DataRdyUSART()){
            usart_buf[usart_counter] = ReadUSART();
            usart_counter ++;
        }
         */
        PIR1bits.RCIF = 0;
    }
        
    #if defined(USB_INTERRUPT)
        USBDeviceTasks();
    #endif
}
#pragma interruptlow YourLowPriorityISRCode
void YourLowPriorityISRCode()
{
}	
#pragma code

/****main function***/
void main(void){  

    TRISA = 0b11111111;
    TRISB = 0b00010000;
    TRISC = 0b10000000;
    //memset( usart_buf , '\0' , strlen(usart_buf) );

    //First of all, establish communication with the RN 4020 !
    //USART configration
    OpenUSART(USART_TX_INT_OFF & USART_RX_INT_OFF &
                       USART_ASYNCH_MODE & USART_EIGHT_BIT &
                       USART_CONT_RX & USART_BRGH_HIGH, 25);
    /*
    PIR1bits.RCIF = 0;  //usart rx int flag clear
    PIE1bits.RCIE = 1;  //enable usart rx int
    INTCONbits.PEIE = 1;// enable peripheral int?
    */

    //受信バッファ2バイトしかない
    //コールバック受け取ろうとするとハマるから諦めよう
    PORTCbits.RC2 = 0; 
    PORTCbits.RC1 = 0;
    
    //[CMD\r\n]
    getsUSART(usart_buf, 5);
    Delay_s(2);
//delay入れるとおかしくなる？
//途中でヌル0になってる？
    for(i=0; i<strlen(cmd0); i++){
        WriteUSART(cmd0[i]);
    }
    RCSTAbits.CREN = 0;
    RCSTAbits.CREN = 1;    
    Delay_s(5);
    //putsUSART(echo2);
    for(i=0; i<strlen(cmd1); i++){
        WriteUSART(cmd1[i]);
    }
    RCSTAbits.CREN = 0;
    RCSTAbits.CREN = 1;    
    for(i=0; i<strlen(cmd0); i++){
        WriteUSART(cmd0[i]);
    }
    RCSTAbits.CREN = 0;
    RCSTAbits.CREN = 1;
    
    PORTCbits.RC2 = RCSTAbits.OERR; 
    PORTCbits.RC1 = RCSTAbits.FERR;
    
    /*
    putsUSART(cmd1);
    if(RCSTAbits.OERR || RCSTAbits.FERR){
        RCSTA = 0;
        RCSTA = 0x90;
    }
   
    Delay_s(5);
    PORTCbits.RC2 = 0; 
    PORTCbits.RC1 = 1;      
     * 
    putrsUSART("SS,00800000\r");
    Delay_s(1);
    if(RCSTAbits.OERR || RCSTAbits.FERR){
        RCSTA = 0;
        RCSTA = 0x90;
    } 
    PORTCbits.RC2 = 1; 
    PORTCbits.RC1 = 0;      

    putrsUSART("SR,32000000\r");
    Delay_s(1);
    if(RCSTAbits.OERR || RCSTAbits.FERR){
        RCSTA = 0;
        RCSTA = 0x90;
    }
    PORTCbits.RC2 = 1; 
    PORTCbits.RC1 = 1;      

    putrsUSART("R,1\r");
    Delay_s(5);
    if(RCSTAbits.OERR || RCSTAbits.FERR){
        RCSTA = 0;
        RCSTA = 0x90;
    }
    PORTCbits.RC2 = 1; 
    PORTCbits.RC1 = 1;      
    
        putrsUSART("R,1\r");
    Delay_s(5);
    if(RCSTAbits.OERR || RCSTAbits.FERR){
        RCSTA = 0;
        RCSTA = 0x90;
    }
    PORTCbits.RC2 = 1; 
    PORTCbits.RC1 = 1;      
    
        putrsUSART("R,1\r");
    Delay_s(5);
    if(RCSTAbits.OERR || RCSTAbits.FERR){
        RCSTA = 0;
        RCSTA = 0x90;
    }
    PORTCbits.RC2 = 1; 
    PORTCbits.RC1 = 1;      
    
